notes/programming-software-engineering-notes.tex
% Created 2025-09-01 Mon 23:08
% Intended LaTeX compiler: xelatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{fontspec}
\setmainfont{Times New Roman}
\usepackage{geometry}
\geometry{margin=1in}
\usepackage{hyperref}
\author{Souvik}
\date{\today}
\title{Notes on Programming and Software Development}
\hypersetup{
 pdfauthor={Souvik},
 pdftitle={Notes on Programming and Software Development},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section*{Notes on Programming and Software Development}
\label{sec:org9d9ee73}
Excerpt from the introductory material of SICP
\subsection*{Responsibility}
\label{sec:org6f5ce1c}
\begin{itemize}
\item We are not really "responsible" for the successful, error-free, perfect use of the programs. We are responsible for creating them, setting them off in directions. The same can be said about our responsibility towards our own mind.
\end{itemize}
\subsection*{On Large Problems}
\label{sec:org2ed4444}
\begin{itemize}
\item An assault on large problems employs a succession of programs, most of which spring into existence en route.
\item It doesn’t matter what the programs are about and what applications they serve. What does matter is how well they perform and how smoothly they fit with other programs, in the creation of still greater programs.
\item The programmer must seek both perfection of plan and adequacy of collection.
\end{itemize}
\subsection*{Programming as a Model}
\label{sec:org9ac0179}
\begin{itemize}
\item Human mind ↔ Collection of computer programs ↔ Computers.
\item Every computer program is a model, hatched in the mind, of a real or mental process. These models evolve as our understanding of the process improves.
\end{itemize}
\subsection*{Program Truth}
\label{sec:orgd648130}
\begin{itemize}
\item As in every other symbolic activity, we become convinced of program truth through argument.
\item If a program’s function can be specified in predicate calculus, then proof methods of logic can be used to make acceptable correctness arguments.
\end{itemize}
\subsection*{Growth of Programs}
\label{sec:org3343576}
\begin{itemize}
\item Since large programs grow from small programs, it is essential that we develop an arsenal of standard program structures (idioms). These constructions can be combined into larger structures using organizational techniques of proven value.
\end{itemize}
\subsection*{Hardware and Programming}
\label{sec:org21c5a5b}
\begin{itemize}
\item Each breakthrough in hardware technology leads to more massive programming enterprises, new organizational principles, and an enrichment of abstract models. In modern times, new programming techniques are driving the exploitation of hardware. Example: probabilistic software for machine learning applications. The advancement of SIMD processors, CPUs, and storage technology has happened in parallel to the growth in applications of machine learning and deep learning.
\end{itemize}
\subsection*{Programmer’s Role}
\label{sec:org1c92ac5}
\begin{itemize}
\item A programmer should acquire good algorithms and idioms. It is the responsibility of the programmer to always examine and attempt to improve their performance.
\end{itemize}
\subsection*{Software and AI}
\label{sec:orgd7fe6cf}
\begin{itemize}
\item The critical concerns of software engineering and artificial intelligence tend to coalesce as the systems under investigation become larger.
\end{itemize}
\subsection*{Nature of Programming Languages}
\label{sec:org2cda380}
\begin{itemize}
\item A programming language is not just a way of getting a computer to perform operations. It is a novel formal medium for expressing ideas about methodology.
\item Programs must be written for people to read, and only incidentally for machines to execute.
\end{itemize}
\subsection*{Computation and Mathematics}
\label{sec:org815b625}
\begin{itemize}
\item The computer revolution is a revolution in the way we think and in how we express what we think.
\item Mathematics provides a framework for dealing precisely with the notion of “what is.”
\item Computation provides a framework for dealing precisely with the notion of “how to.”
\end{itemize}
\subsection*{Simplicity and Modeling}
\label{sec:orgdc97dbd}
\begin{itemize}
\item One should avoid the complexities of control and concentrate on organizing the data to reflect the real structure of the world being modeled.
\end{itemize}
\subsection*{Power of Programming}
\label{sec:org2a5152a}
\begin{itemize}
\item The ability to write and modify programs provides a powerful medium in which exploring becomes a natural activity.
\end{itemize}
\end{document}
